---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.TwoPointsSelectedBeforeEdit
source: html/2513177a-7141-f0f8-ce1a-c7e605c4d110.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.TwoPointsSelectedBeforeEdit Property

Two points have to be selected before existing the edit mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId TwoPointsSelectedBeforeEdit { get; }
```